
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Сумма = ТоварыИУслуги.Итог("Сумма");
КонецПроцедуры



Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	ДвижениеВзаиморасчетыСКонтрагентами = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	ДвижениеВзаиморасчетыСКонтрагентами.ВидДвижения = ВидДвиженияНакопления.Расход;
	ДвижениеВзаиморасчетыСКонтрагентами.Период = Дата;
	ДвижениеВзаиморасчетыСКонтрагентами.Контрагент = Поставщик;
	ДвижениеВзаиморасчетыСКонтрагентами.Сумма = Сумма;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровИУслугТоварыИУслуги.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровИУслугТоварыИУслуги.Количество КАК Количество,
		|	ПоступлениеТоваровИУслугТоварыИУслуги.Сумма КАК Сумма,
		|	НоменклатураСправочник.Тип КАК Тип
		|ИЗ
		|	Документ.ПоступлениеТоваровИУслуг.ТоварыИУслуги КАК ПоступлениеТоваровИУслугТоварыИУслуги
		|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
		|		ПО ПоступлениеТоваровИУслугТоварыИУслуги.Номенклатура = НоменклатураСправочник.Ссылка
		|ГДЕ
		|	ПоступлениеТоваровИУслугТоварыИУслуги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.Товары.Записывать = Истина;
	Движения.Расходы.Записывать = Истина;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Тип = Перечисления.ТипНоменклатуры.Товар Тогда
			ДвижениеТовары = Движения.Товары.Добавить();
			ДвижениеТовары.ВидДвижения = ВидДвиженияНакопления.Приход;
			ДвижениеТовары.Период = Дата;
			ДвижениеТовары.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			ДвижениеТовары.Количество = ВыборкаДетальныеЗаписи.Количество;
			ДвижениеТовары.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		ИначеЕсли ВыборкаДетальныеЗаписи.Тип = Перечисления.ТипНоменклатуры.Услуга Тогда
			ДвижениеРасходы = Движения.Расходы.Добавить();
			ДвижениеРасходы.Период = Дата;
			ДвижениеРасходы.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			ДвижениеРасходы.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		КонецЕсли;
	КонецЦикла;
	
		
	
	
КонецПроцедуры

