
&НаКлиенте
Процедура СкидкиНоменклатураНоменклатурнаяГруппаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Скидки.ТекущиеДанные;
	ПриИзмененииНоменклатурыНоменклатурнойГруппы(СтрокаТЧ)
КонецПроцедуры


Функция ПриИзмененииНоменклатурыНоменклатурнойГруппы(ИзмененнаяСтрока) 

	Если ЗначениеЗаполнено(ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа) Тогда 
		ИзмененнаяСтрока.Скидка = ЦеныВызовСервера.СкидкаНаДату(ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа, Объект.Дата);
	КонецЕсли;
	
КонецФункции
