
&НаКлиенте
Процедура ЦеныНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Цены.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПриИзмененииНоменклатуры(ТекущиеДанные);
	
	
КонецПроцедуры 


&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ИзмененнаяСтрока)
	
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда
		ИзмененнаяСтрока.Цена = ЦеныВызовСервера.ЦенаНаДату(ИзмененнаяСтрока.Номенклатура, Объект.Дата);
	КонецЕсли;
			
 КонецПроцедуры 


&НаКлиенте
Процедура Подбор(Команда)     
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
		
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора",ПараметрыФормы, Элементы.Цены);
КонецПроцедуры



&НаКлиенте
Процедура ЦеныОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("Номенклатура",ВыбранноеЗначение);
	
	СтрокиТаблицы = Объект.Цены.НайтиСтроки(ОтборСтрок);
	
	Если СтрокиТаблицы.Количество() > 0 Тогда 
		НоваяСтрока = Объект.Цены.Добавить(); 
		НоваяСтрока.Номенклатура = ВыбранноеЗначение;
		ПриИзмененииНоменклатуры(НоваяСтрока); 
	КонецЕсли;
	
	НоваяСтрока = Объект.Цены.Добавить();
	НоваяСтрока.Номенклатура = ВыбранноеЗначение;
	
КонецПроцедуры


