
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
		Элементы.КПП.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
		Элементы.КПП.Видимость = Ложь;
		Объект.КПП = "";
	Иначе
		Элементы.КПП.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)  
	
	Если Не ЗапретНаРасшифровкуНаименования Тогда
		Аббревиатура = РасшифровкаНаименованияОПФ(Объект.Наименование);
    	Объект.ПолноеНаименование = Аббревиатура;
	КонецЕсли;
	
	КонецПроцедуры
	
&НаКлиентеНаСервереБезКонтекста
Функция РасшифровкаНаименованияОПФ(Наименование)
		
		 	
	СтруктураОПФ = Новый Структура;
	СтруктураОПФ.Вставить("ОАО", "Открытое акционерное общество");
	СтруктураОПФ.Вставить("ЗАО", "Закрытое акционерное общество");
	СтруктураОПФ.Вставить("АО", "Акционерное общество");
	СтруктураОПФ.Вставить("ИП", "Индивидуальный предприниматель"); 
	СтруктураОПФ.Вставить("ООО", "Общество с ограниченной ответственностью"); 
	
	//Выделила сокрщения
	КраткоеНаименование = Лев(Наименование, Найти(Наименование, " ") - 1);
	//Сообщить(КраткоеНаименование);
	
	Для Каждого Элемент Из СтруктураОПФ Цикл 
		Если Элемент.Ключ = КраткоеНаименование Тогда
			Аббревиатура = СтрЗаменить(Наименование, Элемент.Ключ, Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	Возврат Аббревиатура;
	
КонецФункции


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗапретНаРасшифровкуНаименования = ЗначениеЗаполнено(Объект.ПолноеНаименование) И Объект.ПолноеНаименование <> РасшифровкаНаименованияОПФ(Объект.Наименование); 
КонецПроцедуры


&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	Если РаботаСИНН.ИННВерен(Объект.ИНН, Объект.Тип) Тогда 
		Сообщить("ИНН корректен");
		Элементы.ИНН.ЦветФона = webЦвета.ПризрачноБелый;
	Иначе
		Сообщить("ИНН некорректен");
		Элементы.ИНН.ЦветФона = webЦвета.КрасноФиолетовый;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если РаботаСИНН.ИННВерен(Объект.ИНН, Объект.Тип)= Истина Тогда 
		Сообщить("ИНН корректен");
		
	Иначе
		Сообщить("ИНН некорректен");
		Элементы.ИНН.ЦветФона = webЦвета.КрасноФиолетовый;
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

