
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Сумма = ТоварыИУслуги.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
		
	Движения.ВзаиморасчетыСКонтрагентами.Очистить();
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движения.Товары.Очистить();
	Движения.Товары.Записывать = Истина;
	Движения.Доходы.Очистить();
	Движения.Доходы.Записывать = Истина;
	Движения.Расходы.Очистить();
	Движения.Расходы.Записывать = Истина;      
	
	Движения.Управленческий.Очистить();
	Движения.Управленческий.Записывать = Истина;
	
	ДвижениеКонтрагенты = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	ДвижениеКонтрагенты.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеКонтрагенты.Период = Дата;
	ДвижениеКонтрагенты.Контрагент = Покупатель;
	ДвижениеКонтрагенты.Сумма = Сумма;
	
	Движения.ВзаиморасчетыСКонтрагентами.Записать();

		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура КАК Номенклатура,
	               |	РеализацияТоваровИУслугТоварыИУслуги.Количество КАК Количество,
	               |	РеализацияТоваровИУслугТоварыИУслуги.Сумма КАК Сумма,
	               |	ТоварыОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	ТоварыОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |	ТоварыОстатки.Номенклатура.Тип КАК Тип
	               |ИЗ
	               |	Документ.РеализацияТоваровИУслуг.ТоварыИУслуги КАК РеализацияТоваровИУслугТоварыИУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Товары.Остатки КАК ТоварыОстатки
	               |			ПО (ТоварыОстатки.Номенклатура = НоменклатураСправочник.Ссылка)
	               |		ПО РеализацияТоваровИУслугТоварыИУслуги.Номенклатура = НоменклатураСправочник.Ссылка
	               |ГДЕ
	               |	РеализацияТоваровИУслугТоварыИУслуги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Если Выборка.Тип = Перечисления.ТипНоменклатуры.Товар Тогда

			Если Выборка.КоличествоОстаток = 0 ИЛИ НЕ ЗначениеЗаполнено(Выборка.КоличествоОстаток) Тогда
				Отказ = Истина;
				Сообщить(СтрШаблон("Товара %1 нет на складе", Выборка.Номенклатура));
				Продолжить;
			ИначеЕсли Выборка.КоличествоОстаток < Выборка.Количество Тогда
				Отказ = Истина;
				Сообщить(СтрШаблон("Товара %1 не хватает", Выборка.Номенклатура));
				Продолжить; 
			КонецЕсли;
			
			Если Выборка.КоличествоОстаток = Выборка.Количество Тогда
				Себестоимость = Выборка.Сумма;
			Иначе
				СредняяЦена = Выборка.СуммаОстаток/Выборка.КоличествоОстаток;
				Себестоимость = СредняяЦена * Выборка.КоличествоОстаток;
			КонецЕсли;   
			
			ДвижениеТовар = Движения.Товары.Добавить();
			ДвижениеТовар.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеТовар.Период = Дата;
			ДвижениеТовар.Номенклатура = Выборка.Номенклатура;
			ДвижениеТовар.Сумма = Себестоимость;
			ДвижениеТовар.Количество = Выборка.Количество;
			
			ДвижениеРасход = Движения.Расходы.Добавить(); 
			ДвижениеРасход.Период = Дата;
			ДвижениеРасход.Номенклатура = Выборка.Номенклатура; 
			ДвижениеРасход.Сумма = Себестоимость;
			
			Движение = Движения.Управленческий.Добавить();
			Движение.СчетДт = ПланыСчетов.Управленческий.Расходы;
			Движение.СчетКт = ПланыСчетов.Управленческий.Товары;
			Движение.Период = Дата;
			Движение.Сумма = Себестоимость;

		КонецЕсли; 
		
		ДвижениеДоход = Движения.Доходы.Добавить();
		ДвижениеДоход.Период = Дата;
		ДвижениеДоход.Номенклатура = Выборка.Номенклатура;
		ДвижениеДоход.Количество = Выборка.Количество;
		ДвижениеДоход.Сумма = Выборка.Сумма; 
		
				
		Движения.Товары.Записать();
		Движения.Расходы.Записать();
		Движения.Доходы.Записать();
		Движения.Управленческий.Записать();
		
	КонецЦикла;
		
	//Бухгалтерское формирование движения и проводки
	ДвижениеУпр = Движения.Управленческий.Добавить();
	ДвижениеУпр.СчетДт = ПланыСчетов.Управленческий.РасчетыСПокупателями;
	ДвижениеУпр.СчетКт = ПланыСчетов.Управленческий.Выручка;
	ДвижениеУпр.Период = Дата;
	ДвижениеУпр.Сумма = Сумма;

	
	Движения.Управленческий.Записать();
	

	
	
	
КонецПроцедуры


