
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		Если ПравоДоступа("Администрирование", Метаданные) Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = Метаданные.Справочники.Сотрудники.Формы.ФормаАдминистратора;
		Иначе
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = Метаданные.Справочники.Сотрудники.Формы.ФормаПользователя; 
		КонецЕсли;  
		
	КонецЕсли;
	
КонецПроцедуры
