
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	
	
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Цены
	Движения.Цены.Записывать = Истина;
	Для Каждого ТекСтрокаУстановкаЦен Из Цены Цикл
		Движение = Движения.Цены.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаУстановкаЦен.Номенклатура;
		Движение.Цена = ТекСтрокаУстановкаЦен.Цена;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	КонецПроцедуры

	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
			Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	КонецПроцедуры
