
Функция ИННВерен(ИНН, ТипКонтрагента) Экспорт
	
	Результат = Истина;
	
	//Пустое поле ИНН
	Если Не ЗначениеЗаполнено(ИНН) Тогда 
		Результат = Истина;
		Возврат Результат;
	КонецЕсли; 
	
	ДлинаИНН = СтрДлина(ИНН); 
	
	//Только цифры в ИНН
	ТолькоЦифры = Истина;
	
    Для СчетчикИНН = 1 По ДлинаИНН Цикл
			СимволИНН = Сред(ИНН, СчетчикИНН, 1);
			КодСимволаИНН = КодСимвола(СимволИНН);
			Если КодСимволаИНН < 48 Или КодСимволаИНН > 57 Тогда 
				ТолькоЦифры = Ложь;
				Прервать;
			КонецЕсли;
	КонецЦикла;  
	
	Если Не ТолькоЦифры Тогда
		Результат = Ложь;
		Возврат Результат;
	КонецЕсли;
	
	//Расчет корректоности ИНН для юридического лица  
	Если ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
		Если ДлинаИНН = 10 Тогда
			МассивМножителей = Новый Массив;
			МассивМножителей.Добавить(2);
			МассивМножителей.Добавить(4);
			МассивМножителей.Добавить(10);
			МассивМножителей.Добавить(3);
			МассивМножителей.Добавить(5);
			МассивМножителей.Добавить(9);
			МассивМножителей.Добавить(4);
			МассивМножителей.Добавить(6);
			МассивМножителей.Добавить(8);
			МассивМножителей.Добавить(0);
			
			КонтрольнаяСумма = 0;
			Для Счетчик = 1 По ДлинаИНН Цикл 
				Множитель = МассивМножителей[Счетчик - 1];
				ЦифраИНН = Сред(ИНН, Счетчик, 1);
				КонтрольнаяСумма = КонтрольнаяСумма + Множитель * ЦифраИНН;
			КонецЦикла; 
			КонтрольноеЧисло = КонтрольнаяСумма % 11;
			Если КонтрольноеЧисло > 9 Тогда
				 КонтрольноеЧисло = КонтрольноеЧисло % 10;
			КонецЕсли;
			ПоследняяЦифраИНН = Сред(ИНН, ДлинаИНН, 1);  
			
			Если Строка(КонтрольноеЧисло) <> ПоследняяЦифраИНН Тогда 
				Результат = Ложь;
				Возврат Результат;
			Иначе
				Результат = Истина;
				Возврат Результат;
			КонецЕсли;
		Иначе
			Результат = Ложь;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	
	//Расчет корректности ИНН физического лица
	Если ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
		Если ДлинаИНН = 12 Тогда
			
			МассивМножителей1 = Новый Массив;
			МассивМножителей1.Добавить(7);
			МассивМножителей1.Добавить(2);
			МассивМножителей1.Добавить(4);
			МассивМножителей1.Добавить(10);
			МассивМножителей1.Добавить(3);
			МассивМножителей1.Добавить(5);
			МассивМножителей1.Добавить(9);
			МассивМножителей1.Добавить(4);
			МассивМножителей1.Добавить(6);
			МассивМножителей1.Добавить(8);
			МассивМножителей1.Добавить(0);
			КонтрольнаяСумма1 = 0;
			Для Счетчик = 1 По 11 Цикл 
				Множитель1 = МассивМножителей1[Счетчик - 1];
				ЦифраИНН = Сред(ИНН, Счетчик, 1);
				КонтрольнаяСумма1 = КонтрольнаяСумма1 + Множитель1 * ЦифраИНН;
			КонецЦикла; 
			КонтрольноеЧисло1 = КонтрольнаяСумма1 % 11;
			Если КонтрольноеЧисло1 > 9 Тогда
				 КонтрольноеЧисло1 = КонтрольноеЧисло1 % 10;
			КонецЕсли;   
			
			МассивМножителей2 = Новый Массив;
			МассивМножителей2.Добавить(3);
			МассивМножителей2.Добавить(7);
			МассивМножителей2.Добавить(2);
			МассивМножителей2.Добавить(4);
			МассивМножителей2.Добавить(10);
			МассивМножителей2.Добавить(3);
			МассивМножителей2.Добавить(5);
			МассивМножителей2.Добавить(9);
			МассивМножителей2.Добавить(4);
			МассивМножителей2.Добавить(6);
			МассивМножителей2.Добавить(8);
			МассивМножителей2.Добавить(0);
			КонтрольнаяСумма2 = 0;
			Для Счетчик = 1 По ДлинаИНН Цикл 
				Множитель2 = МассивМножителей2[Счетчик - 1];
				ЦифраИНН = Сред(ИНН, Счетчик, 1);
				КонтрольнаяСумма2 = КонтрольнаяСумма2 + Множитель2 * ЦифраИНН;
			КонецЦикла; 
			КонтрольноеЧисло2 = КонтрольнаяСумма2 % 11;
			Если КонтрольноеЧисло2 > 9 Тогда
				 КонтрольноеЧисло2 = КонтрольноеЧисло2 % 10;
			 КонецЕсли;
			 ПредпоследняяЦифраИНН = Сред(ИНН, 11, 1);
			 ПоследняяЦифраИНН = Сред(ИНН, ДЛинаИНН, 1);
			 
			 Если Строка(КонтрольноеЧисло1) <> ПредпоследняяЦифраИНН И Строка(КонтрольноеЧисло2) <> ПоследняяЦифраИНН Тогда 
				Результат = Ложь;
				Возврат Результат;
			Иначе
				Результат = Истина;
				Возврат Результат;
			КонецЕсли;
		Иначе
			Результат = Ложь;
			Возврат Результат;	
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

