
&НаКлиенте
Процедура СлучайныйПароль(Команда)
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	СимволыПароля = "0123456789abcdefghijklmnopqrstuvwxyz_"; 
	Пароль = "";
	Для Н = 1 По 6 Цикл
		Пароль = Пароль + Сред(СимволыПароля, ГСЧ.СлучайноеЧисло(1, СтрДлина(СимволыПароля)), 1);	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УИНСотрудника = ТекущийОбъект.ИдентификаторПользователяИБ;
	Сотрудник = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(УИНСотрудника);
	Если Сотрудник <> Неопределено И УИНСотрудника = "" Тогда 
		ВходРазрешен = Сотрудник.АутентификацияСтандартная;
		ИмяДляВхода = Сотрудник.Имя; 
		ИдентификаторПользователяИБ = Сотрудник.УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторПользователяИБ) Или Объект.ИдентификаторПользователяИБ = "" Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторПользователяИБ);
		ПользовательИБ.Имя = Объект.Наименование;
		ПользовательИБ.АутентификацияСтандартная = ВходРазрешен;
		ПользовательИБ.Записать();
	ИначеЕсли ВходРазрешен Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		ПользовательИБ.Имя = Объект.Наименование;
		ПользовательИБ.АутентификацияСтандартная = ВходРазрешен;
		ПользовательИБ.ПолноеИмя = Объект.Наименование;
		ПользовательИБ.Пароль = Пароль;
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.БазовыеПрава);
		ПользовательИБ.Записать();
		ТекущийОбъект.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
